### AWS UAT App plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/4890428e-7a0a-4e43-86d1-34da56dc7d33/terraform-bin show -no-color plan.tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-af54e33e.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/About-af54e33e.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-45b80bcd.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/ArticleLayouts-45b80bcd.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-abc200d4.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Articles-abc200d4.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-cdca7afd.css"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Articles-cdca7afd.css"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad247451.css"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Landing-ad247451.css"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-db7eac9c.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Landing-db7eac9c.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-19838165.css"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/PDF-19838165.css"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-a433cf2a.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/PDF-a433cf2a.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-b82ce7ab.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Start-b82ce7ab.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-7308c767.css"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/StartButtonFloat-7308c767.css"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-d1e323fd.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/StartButtonFloat-d1e323fd.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-12d70089.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Terminal-12d70089.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-2e2ec67e.css"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Terminal-2e2ec67e.css"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/azure_devicon_forest_green-ee780a3a.svg"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/azure_devicon_forest_green-ee780a3a.svg"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bash_devicon_forest_green-ab536553.svg"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/bash_devicon_forest_green-ab536553.svg"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/d3_devicon_forest_green-b8696bec.svg"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/d3_devicon_forest_green-b8696bec.svg"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-4cbd2440.woff"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/devicons-4cbd2440.woff"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-880373aa.eot"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/devicons-880373aa.eot"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-cbb92633.ttf"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/devicons-cbb92633.ttf"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-d7c9f264.svg"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/devicons-d7c9f264.svg"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-2adefcbc.woff2"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/fontawesome-webfont-2adefcbc.woff2"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-7bfcab6d.eot"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/fontawesome-webfont-7bfcab6d.eot"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-aa58f33f.ttf"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/fontawesome-webfont-aa58f33f.ttf"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-ad615792.svg"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/fontawesome-webfont-ad615792.svg"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-ba0c59de.woff"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/fontawesome-webfont-ba0c59de.woff"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/github_profile_pic-66b10136.jpg"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/github_profile_pic-66b10136.jpg"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/html2canvas.esm-0a33ed42.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/html2canvas.esm-0a33ed42.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-9a0f5c31.css"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/index-9a0f5c31.css"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-f711b34b.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/index-f711b34b.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-1ae83452.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/index.es-1ae83452.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/powershell_devicon_forest_green-f06a1fda.svg"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/powershell_devicon_forest_green-f06a1fda.svg"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/purify.es-3ef59d4c.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/purify.es-3ef59d4c.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/recase-24e0a860.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/recase-24e0a860.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/tableau_logo-ec7acb2d.svg"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/tableau_logo-ec7acb2d.svg"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/terraform_devicon_forest_green-e7c4748a.svg"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/terraform_devicon_forest_green-e7c4748a.svg"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ts_devicon_forest_green-0c5eea9d.svg"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/ts_devicon_forest_green-0c5eea9d.svg"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/vue_devicon_forest_green-2e14a2aa.svg"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/vue_devicon_forest_green-2e14a2aa.svg"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["favicon.ico"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "favicon.ico"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "index.html"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3_object_uat.aws_s3_bucket_object.this["_headers"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/plain"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "_headers"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/_headers"
      + source_hash            = "8274f68f0ec4b7bd6eab988987eaf299"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "about.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/about.html"
      + source_hash            = "7f5638b311d706f2b107afbdffb99cb7"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/404-8c89564b.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/404-8c89564b.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/404-8c89564b.js"
      + source_hash            = "ed91a87c4d3fc86a5c1c2fdf99c5fead"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-af54e33e.js"] will be destroyed
  # (because key ["assets/About-af54e33e.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "a92e5bf9ff9dec037b5e5a818228e383" -> null
      - force_destroy          = true -> null
      - id                     = "assets/About-af54e33e.js" -> null
      - key                    = "assets/About-af54e33e.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/About-af54e33e.js" -> null
      - source_hash            = "a92e5bf9ff9dec037b5e5a818228e383" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-45b80bcd.js"] will be destroyed
  # (because key ["assets/ArticleLayouts-45b80bcd.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "6aea85fb90c9a61defc42ea2f1bdd960" -> null
      - force_destroy          = true -> null
      - id                     = "assets/ArticleLayouts-45b80bcd.js" -> null
      - key                    = "assets/ArticleLayouts-45b80bcd.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/ArticleLayouts-45b80bcd.js" -> null
      - source_hash            = "6aea85fb90c9a61defc42ea2f1bdd960" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-abc200d4.js"] will be destroyed
  # (because key ["assets/Articles-abc200d4.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "7e1dfd2dc8a5ee4b4955c4dab9170982" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Articles-abc200d4.js" -> null
      - key                    = "assets/Articles-abc200d4.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/Articles-abc200d4.js" -> null
      - source_hash            = "7e1dfd2dc8a5ee4b4955c4dab9170982" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-cdca7afd.css"] will be destroyed
  # (because key ["assets/Articles-cdca7afd.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "d254e9f4850a323e5ea30df3ac31964d" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Articles-cdca7afd.css" -> null
      - key                    = "assets/Articles-cdca7afd.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/Articles-cdca7afd.css" -> null
      - source_hash            = "d254e9f4850a323e5ea30df3ac31964d" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad247451.css"] will be destroyed
  # (because key ["assets/Landing-ad247451.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "623d1343a7416bbbdbce909629e9939d" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-ad247451.css" -> null
      - key                    = "assets/Landing-ad247451.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/Landing-ad247451.css" -> null
      - source_hash            = "623d1343a7416bbbdbce909629e9939d" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-db7eac9c.js"] will be destroyed
  # (because key ["assets/Landing-db7eac9c.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "17c5dfdc342c2416f507ad7fcb8b9682" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-db7eac9c.js" -> null
      - key                    = "assets/Landing-db7eac9c.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/Landing-db7eac9c.js" -> null
      - source_hash            = "17c5dfdc342c2416f507ad7fcb8b9682" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-19838165.css"] will be destroyed
  # (because key ["assets/PDF-19838165.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "e24945a32789e1abf50be49be251389e" -> null
      - force_destroy          = true -> null
      - id                     = "assets/PDF-19838165.css" -> null
      - key                    = "assets/PDF-19838165.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/PDF-19838165.css" -> null
      - source_hash            = "e24945a32789e1abf50be49be251389e" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-a433cf2a.js"] will be destroyed
  # (because key ["assets/PDF-a433cf2a.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "8d89581807d6c1c618e266b88c96e702" -> null
      - force_destroy          = true -> null
      - id                     = "assets/PDF-a433cf2a.js" -> null
      - key                    = "assets/PDF-a433cf2a.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/PDF-a433cf2a.js" -> null
      - source_hash            = "8d89581807d6c1c618e266b88c96e702" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/README-8752f6ce.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/README-8752f6ce.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/README-8752f6ce.js"
      + source_hash            = "b0529af8bda37bb2fc536eb4984dd0dd"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-b82ce7ab.js"] will be destroyed
  # (because key ["assets/Start-b82ce7ab.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "af5ebf02485dec5a476c3d41e227aa5c" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Start-b82ce7ab.js" -> null
      - key                    = "assets/Start-b82ce7ab.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/Start-b82ce7ab.js" -> null
      - source_hash            = "af5ebf02485dec5a476c3d41e227aa5c" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-7308c767.css"] will be destroyed
  # (because key ["assets/StartButtonFloat-7308c767.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "fff573f20a9b2c51b01a41b063cbf6bd" -> null
      - force_destroy          = true -> null
      - id                     = "assets/StartButtonFloat-7308c767.css" -> null
      - key                    = "assets/StartButtonFloat-7308c767.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/StartButtonFloat-7308c767.css" -> null
      - source_hash            = "fff573f20a9b2c51b01a41b063cbf6bd" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-d1e323fd.js"] will be destroyed
  # (because key ["assets/StartButtonFloat-d1e323fd.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "538edd160449fc19008186b8965f28a7" -> null
      - force_destroy          = true -> null
      - id                     = "assets/StartButtonFloat-d1e323fd.js" -> null
      - key                    = "assets/StartButtonFloat-d1e323fd.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/StartButtonFloat-d1e323fd.js" -> null
      - source_hash            = "538edd160449fc19008186b8965f28a7" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-12d70089.js"] will be destroyed
  # (because key ["assets/Terminal-12d70089.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "66964670c414b9f1a947e184fd286b37" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Terminal-12d70089.js" -> null
      - key                    = "assets/Terminal-12d70089.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/Terminal-12d70089.js" -> null
      - source_hash            = "66964670c414b9f1a947e184fd286b37" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-2e2ec67e.css"] will be destroyed
  # (because key ["assets/Terminal-2e2ec67e.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "85561bf1ef41088b8c3f0f50a6a1fa81" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Terminal-2e2ec67e.css" -> null
      - key                    = "assets/Terminal-2e2ec67e.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/Terminal-2e2ec67e.css" -> null
      - source_hash            = "85561bf1ef41088b8c3f0f50a6a1fa81" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_...all_-0334078a.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/_...all_-0334078a.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/_...all_-0334078a.js"
      + source_hash            = "b20c613676ee4799b1f0002e858d6baf"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/_name_-47568c73.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/_name_-47568c73.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/_name_-47568c73.js"
      + source_hash            = "5f21036c944817e3d81eb51f55c502ef"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/about-d6b2d3af.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/about-d6b2d3af.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/about-d6b2d3af.js"
      + source_hash            = "faf121b0bd4ec63bc3adf0c9eaa79137"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-3fb78100.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/app-3fb78100.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/app-3fb78100.js"
      + source_hash            = "34f3edeaf68aab44122807a534ba15ab"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/azure_devicon_forest_green-ee780a3a.svg"] will be destroyed
  # (because key ["assets/azure_devicon_forest_green-ee780a3a.svg"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "image/svg+xml" -> null
      - etag                   = "e60911495dba8bb96def57539a94e9cf" -> null
      - force_destroy          = true -> null
      - id                     = "assets/azure_devicon_forest_green-ee780a3a.svg" -> null
      - key                    = "assets/azure_devicon_forest_green-ee780a3a.svg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/azure_devicon_forest_green-ee780a3a.svg" -> null
      - source_hash            = "e60911495dba8bb96def57539a94e9cf" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bash_devicon_forest_green-ab536553.svg"] will be destroyed
  # (because key ["assets/bash_devicon_forest_green-ab536553.svg"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "image/svg+xml" -> null
      - etag                   = "302f026f7e053d0ccf4b0ed827f15900" -> null
      - force_destroy          = true -> null
      - id                     = "assets/bash_devicon_forest_green-ab536553.svg" -> null
      - key                    = "assets/bash_devicon_forest_green-ab536553.svg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/bash_devicon_forest_green-ab536553.svg" -> null
      - source_hash            = "302f026f7e053d0ccf4b0ed827f15900" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/d3_devicon_forest_green-b8696bec.svg"] will be destroyed
  # (because key ["assets/d3_devicon_forest_green-b8696bec.svg"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "image/svg+xml" -> null
      - etag                   = "89db6545390762231d3913a3cd717cf3" -> null
      - force_destroy          = true -> null
      - id                     = "assets/d3_devicon_forest_green-b8696bec.svg" -> null
      - key                    = "assets/d3_devicon_forest_green-b8696bec.svg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/d3_devicon_forest_green-b8696bec.svg" -> null
      - source_hash            = "89db6545390762231d3913a3cd717cf3" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-4cbd2440.woff"] will be destroyed
  # (because key ["assets/devicons-4cbd2440.woff"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "font/woff" -> null
      - etag                   = "a8639dec5833a8375d22fe425b01f4eb" -> null
      - force_destroy          = true -> null
      - id                     = "assets/devicons-4cbd2440.woff" -> null
      - key                    = "assets/devicons-4cbd2440.woff" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/devicons-4cbd2440.woff" -> null
      - source_hash            = "a8639dec5833a8375d22fe425b01f4eb" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-880373aa.eot"] will be destroyed
  # (because key ["assets/devicons-880373aa.eot"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/vnd.ms-fontobject" -> null
      - etag                   = "36c5ab9318386dc0499a0d89691e6331" -> null
      - force_destroy          = true -> null
      - id                     = "assets/devicons-880373aa.eot" -> null
      - key                    = "assets/devicons-880373aa.eot" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/devicons-880373aa.eot" -> null
      - source_hash            = "36c5ab9318386dc0499a0d89691e6331" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "T
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*